src/Documents/инкКадровыйПеревод/инкКадровыйПеревод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>инкКадровыйПеревод</name>
  <registerRecords>InformationRegister.инкРеестрКадровыхДокументов</registerRecords>
  <registerRecords>InformationRegister.инкКадроваяИсторияСотрудников</registerRecords>
  <attributes>
    <name>ВидПеревода</name>
    <type>
      <types>EnumRef.инкВидПеревода</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРабочейНедели</name>
    <type>
      <types>EnumRef.инкВидРабочейНедели</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.инкДолжности</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.инкОснованияДляКадровыхПриказов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.инкПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПеревода</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СевернаяНадбавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/инкКадровыйПеревод/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения) Тогда
		ЗаполнитьЗначенияСвойств(Объект,Параметры.ЗначенияЗаполнения);
		СотрудникПриИзмененииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	ЗагрузитьИсториюПоКадровымДаннымНаСервере(Объект.Сотрудник);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	СотрудникПриИзмененииНаСервере();
КонецПроцедуры   

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()

	ЗагрузитьИсториюПоКадровымДаннымНаСервере(Объект.Сотрудник);  
	инкКадровыйУчетСервер.ЗагрузитьДанныеПоСотрудникуНаСервере(Объект);
		
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();	
КонецПроцедуры                      

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	Объект.Руководитель = Объект.Организация.Руководитель;
КонецПроцедуры                            

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьИсториюПоКадровымДаннымНаСервере(СотрудникСсылка)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДанныеПоСотруднику = ДокументОбъект.ПолучитьИсториюКадровыхДанныхПоСотруднику();
	
	Для каждого ЭлементСтруктуры Из ДанныеПоСотруднику Цикл
		
		ИмяРеквизитаФормы = "ист"+ЭлементСтруктуры.Ключ;
		Если инкОбщийКлиентСервер.ЕстьСвойство(ЭтаФорма,ИмяРеквизитаФормы) Тогда
			ЭтаФорма[ИмяРеквизитаФормы] = ЭлементСтруктуры.Значение;	
		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры

#Область о // Печать:

&НаКлиенте
Процедура инкПриказОКадровыхИзмененияхТ5(Команда)

	ТабличныйДокумент = ПолучитьТабличныйДокументТ5(); 
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;   
	ТабличныйДокумент.АвтоМасштаб = Истина;        
	ТабличныйДокумент.ПолеСлева = 20;
	ТабличныйДокумент.ПолеСправа = 0;
	инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"",ЭтаФорма);

КонецПроцедуры    

&НаСервере
Функция ПолучитьТабличныйДокументТ5()
		
	МенеджерПечати = РеквизитФормыВЗначение("Объект");
	ТабличныйДокумент = МенеджерПечати.СформироватьТабличныйДокументТ5();
	
	Возврат ТабличныйДокумент; 
	
КонецФункции 

#КонецОбласти

#КонецОбласти
